{
  "add_cross_attention": false,
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-ADDRESS",
    "2": "B-API_KEY",
    "3": "B-CREDIT_CARD",
    "4": "B-DATE_OF_BIRTH",
    "5": "B-DRIVER_LICENSE",
    "6": "B-EMAIL",
    "7": "B-IP_ADDRESS",
    "8": "B-PASSWORD",
    "9": "B-PERSON_NAME",
    "10": "B-PHONE",
    "11": "B-SSN",
    "12": "B-USERNAME",
    "13": "B-AADHAAR",
    "14": "B-PAN_CARD",
    "15": "B-PASSPORT",
    "16": "B-UPI_ID",
    "17": "B-VEHICLE_REG",
    "18": "I-ADDRESS",
    "19": "I-API_KEY",
    "20": "I-CREDIT_CARD",
    "21": "I-DATE_OF_BIRTH",
    "22": "I-DRIVER_LICENSE",
    "23": "I-EMAIL",
    "24": "I-IP_ADDRESS",
    "25": "I-PASSWORD",
    "26": "I-PERSON_NAME",
    "27": "I-PHONE",
    "28": "I-SSN",
    "29": "I-USERNAME",
    "30": "I-AADHAAR",
    "31": "I-PAN_CARD",
    "32": "I-PASSPORT",
    "33": "I-UPI_ID",
    "34": "I-VEHICLE_REG"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "B-AADHAAR": 13,
    "B-ADDRESS": 1,
    "B-API_KEY": 2,
    "B-CREDIT_CARD": 3,
    "B-DATE_OF_BIRTH": 4,
    "B-DRIVER_LICENSE": 5,
    "B-EMAIL": 6,
    "B-IP_ADDRESS": 7,
    "B-PAN_CARD": 14,
    "B-PASSPORT": 15,
    "B-PASSWORD": 8,
    "B-PERSON_NAME": 9,
    "B-PHONE": 10,
    "B-SSN": 11,
    "B-UPI_ID": 16,
    "B-USERNAME": 12,
    "B-VEHICLE_REG": 17,
    "I-AADHAAR": 30,
    "I-ADDRESS": 18,
    "I-API_KEY": 19,
    "I-CREDIT_CARD": 20,
    "I-DATE_OF_BIRTH": 21,
    "I-DRIVER_LICENSE": 22,
    "I-EMAIL": 23,
    "I-IP_ADDRESS": 24,
    "I-PAN_CARD": 31,
    "I-PASSPORT": 32,
    "I-PASSWORD": 25,
    "I-PERSON_NAME": 26,
    "I-PHONE": 27,
    "I-SSN": 28,
    "I-UPI_ID": 33,
    "I-USERNAME": 29,
    "I-VEHICLE_REG": 34,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "tie_word_embeddings": true,
  "transformers_version": "5.12.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 30522
}
